Revit 2027 API
UIApplication.FabricationPartBrowserChanged Event
 Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<FabricationPartBrowserChangedEventArgs> FabricationPartBrowserChanged
Public Event FabricationPartBrowserChanged As EventHandler(Of FabricationPartBrowserChangedEventArgs)
public:
 event EventHandler<FabricationPartBrowserChangedEventArgs^>^ FabricationPartBrowserChanged {
	void add (EventHandler<FabricationPartBrowserChangedEventArgs^>^ value);
	void remove (EventHandler<FabricationPartBrowserChangedEventArgs^>^ value);
}
member FabricationPartBrowserChanged : IEvent<EventHandler<FabricationPartBrowserChangedEventArgs>,
    FabricationPartBrowserChangedEventArgs>
Value
EventHandler<FabricationPartBrowserChangedEventArgs>
Remarks
More docs about the different conditions goes here
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace